arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_spi_driver.c
/*
 * Copyright (c) 2014 - 2016, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_flexio_spi_driver.h"
#include "fsl_interrupt_manager.h"
#include "fsl_flexio_hal.h"
#include "fsl_clock_manager.h"

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @cond DRIVER_INTERNAL_USE_ONLY */

    /* Constraints used for baud rate computation */
#define DIVIDER_MIN_VALUE 1U
#define DIVIDER_MAX_VALUE 0xFFU

    /* Shifters/Timers used for SPI simulation */
#define TX_SHIFTER     0U
#define RX_SHIFTER     1U
#define SCK_TIMER        0U
#define SS_TIMER         1U

    /* Dummy data to send when user provides no data */
#define FLEXIO_SPI_DUMMYDATA (0xFFFFFFFFU)

/* Table of base addresses for FLEXIO instances. */
FLEXIO_Type * const g_flexioBase[FLEXIO_INSTANCE_COUNT] = FLEXIO_BASE_PTRS;

/* Pointer to runtime state structure.*/
void * g_flexioSPIStatePtr[FLEXIO_INSTANCE_COUNT] = {NULL};

/* Table for FLEXIO IRQ numbers */
const IRQn_Type g_flexioIrqId[FLEXIO_INSTANCE_COUNT] = FLEXIO_IRQS;

/* PCC clock sources, for getting the input clock frequency */
const clock_names_t g_flexioClock[FLEXIO_INSTANCE_COUNT] = {PCC_FLEXIO0_CLOCK};

/* Table to save FLEXIO ISRs - for installing interrupt handlers at runtime */
extern const isr_t g_flexioIsr[FLEXIO_INSTANCE_COUNT];

/*******************************************************************************
 * Private Functions
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterComputeBaudRateDivider
 * Description   : Computes the baud rate divider for a target baud rate
 *
 *END**************************************************************************/
static flexio_spi_status_t FLEXIO_SPI_DRV_MasterComputeBaudRateDivider(uint32_t instance, uint32_t baudRate, uint16_t *divider)
{
    uint32_t inputClock;
    uint32_t tmpDiv;
    clock_manager_error_code_t clkErr;

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_SPI_STATUS_FAIL;
    }

    /* Compute divider: ((input_clock / baud_rate) / 2) - 1. Round to nearest integer */
    tmpDiv = (inputClock + baudRate) / (2U * baudRate) - 1U;
    /* Enforce upper/lower limits */
    if (tmpDiv < DIVIDER_MIN_VALUE)
    {
        tmpDiv = DIVIDER_MIN_VALUE;
    }
    if (tmpDiv > DIVIDER_MAX_VALUE)
    {
        tmpDiv = DIVIDER_MAX_VALUE;
    }
    
    *divider = (uint16_t)tmpDiv;
    return FLEXIO_SPI_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterConfigure
 * Description   : configures the FLEXIO module as SPI master
 *
 *END**************************************************************************/
static flexio_spi_status_t FLEXIO_SPI_DRV_MasterConfigure(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_master_state_t *master;
    flexio_pin_polarity_t clockPolarity;        /* Polarity of clock signal */
    flexio_timer_polarity_t txShifterPolarity;  /* Polarity of MOSI shifter */
    flexio_timer_polarity_t rxShifterPolarity;  /* Polarity of MISO shifter */
    uint16_t divider;
    flexio_spi_status_t retCode;

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];
 
    /* Compute divider.*/
    retCode = FLEXIO_SPI_DRV_MasterComputeBaudRateDivider(instance, master->baudRate, &divider);
    if (retCode != FLEXIO_SPI_STATUS_SUCCESS)
    {
        return retCode;
    }

    if (master->clockPolarity == 0)
    {
        /* CPOL = 0 */
        clockPolarity = FLEXIO_PIN_POLARITY_HIGH;
    }
    else
    {
        /* CPOL = 1 */
        clockPolarity = FLEXIO_PIN_POLARITY_LOW;
    }

    if (master->clockPhase == 0)
    {
        /* CPHA = 0 */
        txShifterPolarity = FLEXIO_TIMER_POLARITY_NEGEDGE;
        rxShifterPolarity = FLEXIO_TIMER_POLARITY_POSEDGE;
    }
    else
    {
        /* CPHA = 1 */
        txShifterPolarity = FLEXIO_TIMER_POLARITY_POSEDGE;
        rxShifterPolarity = FLEXIO_TIMER_POLARITY_NEGEDGE;
    }
    /* Configure Tx shifter (MOSI) */
    FLEXIO_HAL_SetShifterTimer(baseAddr, TX_SHIFTER, SCK_TIMER, txShifterPolarity);
    FLEXIO_HAL_SetShifterPin(baseAddr, TX_SHIFTER, master->mosiPin, FLEXIO_PIN_POLARITY_HIGH, FLEXIO_PIN_CONFIG_OUTPUT);
    FLEXIO_HAL_SetShifterMode(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_MODE_TRANSMIT);

    if (master->clockPhase != 0U)
    {
        /* CPHA = 1 */
        FLEXIO_HAL_SetShifterStopBit(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_STOP_BIT_0);
        FLEXIO_HAL_SetShifterStartBit(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_START_BIT_DISABLED_SH);
    }

