arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_spi_driver.c
    /* Configure Rx shifter (MISO) */
    FLEXIO_HAL_SetShifterTimer(baseAddr, RX_SHIFTER, SCK_TIMER, rxShifterPolarity);
    FLEXIO_HAL_SetShifterPin(baseAddr, RX_SHIFTER, master->misoPin, FLEXIO_PIN_POLARITY_HIGH, FLEXIO_PIN_CONFIG_DISABLED);
    FLEXIO_HAL_SetShifterMode(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_MODE_RECEIVE);

    /* Configure sck timer */
    FLEXIO_HAL_SetTimerEnable(baseAddr, SCK_TIMER, FLEXIO_TIMER_ENABLE_TRG_HIGH);
    FLEXIO_HAL_SetTimerDisable(baseAddr, SCK_TIMER, FLEXIO_TIMER_DISABLE_TIM_CMP);
    FLEXIO_HAL_SetTimerStart(baseAddr, SCK_TIMER, FLEXIO_TIMER_START_BIT_ENABLED);
    FLEXIO_HAL_SetTimerStop(baseAddr, SCK_TIMER, FLEXIO_TIMER_STOP_BIT_TIM_DIS);
    FLEXIO_HAL_SetTimerInitialOutput(baseAddr, SCK_TIMER, FLEXIO_TIMER_INITOUT_ZERO);
    FLEXIO_HAL_SetTimerPin(baseAddr, SCK_TIMER, master->sckPin, clockPolarity, FLEXIO_PIN_CONFIG_OUTPUT);
    FLEXIO_HAL_SetTimerTrigger(baseAddr, SCK_TIMER, (TX_SHIFTER << 2U) + 1U, FLEXIO_TRIGGER_POLARITY_LOW, FLEXIO_TRIGGER_SOURCE_INTERNAL);
    FLEXIO_HAL_SetTimerMode(baseAddr, SCK_TIMER, FLEXIO_TIMER_MODE_8BIT_BAUD);
    FLEXIO_HAL_SetTimerCompare(baseAddr, SCK_TIMER, divider); /* set baud rate, number of bits will be updated later */

    /* Configure SS timer */
    FLEXIO_HAL_SetTimerEnable(baseAddr, SS_TIMER, FLEXIO_TIMER_ENABLE_TIM_ENABLE);
    FLEXIO_HAL_SetTimerDisable(baseAddr, SS_TIMER, FLEXIO_TIMER_DISABLE_TIM_DISABLE);
    FLEXIO_HAL_SetTimerCompare(baseAddr, SS_TIMER, 0xFFFFU);
    FLEXIO_HAL_SetTimerPin(baseAddr, SS_TIMER, master->ssPin, FLEXIO_PIN_POLARITY_LOW, FLEXIO_PIN_CONFIG_OUTPUT);
    FLEXIO_HAL_SetTimerMode(baseAddr, SS_TIMER, FLEXIO_TIMER_MODE_16BIT);

    return FLEXIO_SPI_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterWaitTransferEnd
 * Description   : waits for the end of a blocking transfer
 *
 *END**************************************************************************/
flexio_spi_status_t FLEXIO_SPI_DRV_MasterWaitTransferEnd(uint32_t instance)
{
    flexio_spi_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];
    switch (master->driverType)
    {
        case FLEXIO_SPI_DRIVER_TYPE_INTERRUPTS:
            /* Wait for transfer to be completed by the IRQ */
            while (master->driverIdle == false);
            break;
        case FLEXIO_SPI_DRIVER_TYPE_POLLING:
            /* Call FLEXIO_SPI_DRV_MasterGetStatus() to do the transfer */
            while (FLEXIO_SPI_DRV_MasterGetStatus(instance, NULL) == FLEXIO_SPI_STATUS_BUSY);
            break;
        case FLEXIO_SPI_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    return master->status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterStopTransfer
 * Description   : Forcefully stops the current transfer
 *
 *END**************************************************************************/
static void FLEXIO_SPI_DRV_MasterStopTransfer(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_master_state_t *master;

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    master->driverIdle = true;
    /* Call HAL_Init to reset module */
    FLEXIO_HAL_Init(baseAddr);
    /* Will re-initialize module on next use (not here because it takes a 
       long time and we may be inside an interrupt handler) */
    master->needReinit = true;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterEndTransfer
 * Description   : end a transfer
 *
 *END**************************************************************************/
void FLEXIO_SPI_DRV_MasterEndTransfer(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    /* Disable transfer engine */
    switch (master->driverType)
    {
        case FLEXIO_SPI_DRIVER_TYPE_INTERRUPTS:
            /* Disable interrupts for Rx and Tx shifters */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, 
                                           (1U << TX_SHIFTER) | (1U << RX_SHIFTER), 
                                           false);
            FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, 
                                                (1U << TX_SHIFTER) | (1U << RX_SHIFTER), 
                                                false);
            break;
        case FLEXIO_SPI_DRIVER_TYPE_POLLING:
            /* Nothing to do here */
            break;
        case FLEXIO_SPI_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    master->driverIdle = true;
    master->txRemainingBytes = 0;
    master->rxRemainingBytes = 0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_SlaveConfigure
 * Description   : configures the FLEXIO module as SPI slave
 *
 *END**************************************************************************/
static flexio_spi_status_t FLEXIO_SPI_DRV_SlaveConfigure(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_slave_state_t *slave;
    flexio_pin_polarity_t clockPolarity;        /* Polarity of clock signal */
    flexio_timer_polarity_t txShifterPolarity;  /* Polarity of MISO shifter */
    flexio_timer_polarity_t rxShifterPolarity;  /* Polarity of MOSI shifter */

    baseAddr = g_flexioBase[instance];
    slave = (flexio_spi_slave_state_t *)g_flexioSPIStatePtr[instance];

    if (slave->clockPolarity == 0)
    {
        /* CPOL = 0 */
        clockPolarity = FLEXIO_PIN_POLARITY_HIGH;
    }
    else
    {
        /* CPOL = 1 */
        clockPolarity = FLEXIO_PIN_POLARITY_LOW;
    }

