arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_spi_driver.c
    if (slave->clockPhase == 0)
    {
        /* CPHA = 0 */
        txShifterPolarity = FLEXIO_TIMER_POLARITY_NEGEDGE;
        rxShifterPolarity = FLEXIO_TIMER_POLARITY_POSEDGE;
    }
    else
    {
        /* CPHA = 1 */
        txShifterPolarity = FLEXIO_TIMER_POLARITY_POSEDGE;
        rxShifterPolarity = FLEXIO_TIMER_POLARITY_NEGEDGE;
    }

    /* Configure Slave Tx shifter (MISO) */
    FLEXIO_HAL_SetShifterTimer(baseAddr, TX_SHIFTER, SCK_TIMER, txShifterPolarity);
    FLEXIO_HAL_SetShifterPin(baseAddr, TX_SHIFTER, slave->misoPin, FLEXIO_PIN_POLARITY_HIGH, FLEXIO_PIN_CONFIG_OUTPUT);
    FLEXIO_HAL_SetShifterMode(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_MODE_TRANSMIT);

    if (slave->clockPhase != 0U)
    {
        /* CPHA = 1 */
        FLEXIO_HAL_SetShifterStartBit(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_START_BIT_DISABLED_SH);
    }

    /* Configure Slave Rx shifter (MOSI) */
    FLEXIO_HAL_SetShifterTimer(baseAddr, RX_SHIFTER, SCK_TIMER, rxShifterPolarity);
    FLEXIO_HAL_SetShifterPin(baseAddr, RX_SHIFTER, slave->mosiPin, FLEXIO_PIN_POLARITY_HIGH, FLEXIO_PIN_CONFIG_DISABLED);
    FLEXIO_HAL_SetShifterMode(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_MODE_RECEIVE);

    /* Configure sck timer  */
    FLEXIO_HAL_SetTimerInitialOutput(baseAddr, SCK_TIMER, FLEXIO_TIMER_INITOUT_ZERO);
    FLEXIO_HAL_SetTimerDisable(baseAddr, SCK_TIMER, FLEXIO_TIMER_DISABLE_TRG);
    FLEXIO_HAL_SetTimerEnable(baseAddr, SCK_TIMER, FLEXIO_TIMER_ENABLE_TRG_POSEDGE);
    FLEXIO_HAL_SetTimerDecrement(baseAddr, SCK_TIMER, FLEXIO_TIMER_DECREMENT_PIN_SHIFT_PIN);
    FLEXIO_HAL_SetTimerTrigger(baseAddr, SCK_TIMER, slave->ssPin << 1U, FLEXIO_TRIGGER_POLARITY_LOW, FLEXIO_TRIGGER_SOURCE_INTERNAL);
    FLEXIO_HAL_SetTimerPin(baseAddr, SCK_TIMER, slave->sckPin, clockPolarity, FLEXIO_PIN_CONFIG_DISABLED);
    FLEXIO_HAL_SetTimerMode(baseAddr, SCK_TIMER, FLEXIO_TIMER_MODE_16BIT);
    FLEXIO_HAL_SetTimerCompare(baseAddr, SCK_TIMER, 0x003FU);

    return FLEXIO_SPI_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_ReadData
 * Description   : reads data received by the module
 *
 *END**************************************************************************/
static void FLEXIO_SPI_DRV_ReadData(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_master_state_t *master;
    uint32_t data;

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    /* Read data from shifter buffer */
    if (master->bit_order == FLEXIO_SPI_TRANSFER_LSB_FIRST)
    {
        /* For data size < 4 bytes our data is in the upper part of the buffer and must be shifted */
        data = FLEXIO_HAL_ReadShifterBuffer(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_RW_MODE_NORMAL);
        data >>= (32U - 8U * (uint32_t)(master->transfer_size));
    }
    else
    {
        data = FLEXIO_HAL_ReadShifterBuffer(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_RW_MODE_BIT_SWAP);
    }

    if ((master->rxRemainingBytes > 0) && (master->rxData != NULL))
    {
        switch (master->transfer_size)
        {
            case FLEXIO_SPI_TRANSFER_1BYTE:
                *(uint8_t *)master->rxData = (uint8_t)data;
                break;
            case FLEXIO_SPI_TRANSFER_2BYTE:
                *(uint16_t *)master->rxData = (uint16_t)data;
                break;
            case FLEXIO_SPI_TRANSFER_4BYTE:
                *(uint32_t *)master->rxData = (uint32_t)data;
                break;
            default:
                /* Not possible */
                break;
        }
        /* Update rx buffer pointer and remaining bytes count */
        master->rxData += (uint32_t)(master->transfer_size);
        master->rxRemainingBytes -= (uint32_t)(master->transfer_size);
    }
    else
    {
        /* No data to receive, just ignore the read data */
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_WriteData
 * Description   : writes data to be transmitted by the module
 *
 *END**************************************************************************/
static void FLEXIO_SPI_DRV_WriteData(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_master_state_t *master;
    uint32_t data = FLEXIO_SPI_DUMMYDATA;

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    if (master->txRemainingBytes == 0)
    {
        /* Done transmitting */
        return;
    }

    if ((master->txRemainingBytes > 0) && (master->txData != NULL))
    {
        /* Read data from user buffer */
        switch (master->transfer_size)
        {
            case FLEXIO_SPI_TRANSFER_1BYTE:
                data = (uint32_t)(*(uint8_t *)master->txData);
                break;
            case FLEXIO_SPI_TRANSFER_2BYTE:
                data = (uint32_t)(*(uint16_t *)master->txData);
                break;
            case FLEXIO_SPI_TRANSFER_4BYTE:
                data = (uint32_t)(*(uint32_t *)master->txData);
                break;
            default:
                /* Not possible */
                break;
        }
        /* Update tx buffer pointer and remaining bytes count */
        master->txData += (uint32_t)(master->transfer_size);
        master->txRemainingBytes -= (uint32_t)(master->transfer_size);
        /* Write data to shifter buffer */
        if (master->bit_order == FLEXIO_SPI_TRANSFER_LSB_FIRST)
        {
            FLEXIO_HAL_WriteShifterBuffer(baseAddr, TX_SHIFTER, data, FLEXIO_SHIFTER_RW_MODE_NORMAL);
        }
        else
        {
            /* Shift data before bit-swapping it to get the relevant bits in the lower part of the shifter */
            data <<= 32U - 8U * (uint32_t)(master->transfer_size);
            FLEXIO_HAL_WriteShifterBuffer(baseAddr, TX_SHIFTER, data, FLEXIO_SHIFTER_RW_MODE_BIT_SWAP);
        }
    }
    else
    {
        /* Nothing to send, write dummy data in buffer */
        FLEXIO_HAL_WriteShifterBuffer(baseAddr, TX_SHIFTER, FLEXIO_SPI_DUMMYDATA, FLEXIO_SHIFTER_RW_MODE_NORMAL);
    }
}



/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterCheckStatus
 * Description   : Check status of SPI master transfer. This function can be 
 *                 called either in an interrupt routine or directly in polling 
 *                 mode to advance the SPI transfer.
 *
 *END**************************************************************************/
void FLEXIO_SPI_DRV_MasterCheckStatus(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    /* Check for errors */
    if (FLEXIO_HAL_GetShifterErrorStatus(baseAddr, TX_SHIFTER))
    {
        master->status = FLEXIO_SPI_STATUS_TX_UNDERFLOW;
        FLEXIO_HAL_ClearShifterErrorStatus(baseAddr, TX_SHIFTER);
        /* Force the ongoing transfer to stop */
        FLEXIO_SPI_DRV_MasterStopTransfer(instance);
        /* Stop processing events */
        return;
    }
    if (FLEXIO_HAL_GetShifterErrorStatus(baseAddr, RX_SHIFTER))
    {
        master->status = FLEXIO_SPI_STATUS_RX_OVERFLOW;
        FLEXIO_HAL_ClearShifterErrorStatus(baseAddr, RX_SHIFTER);
        /* Force the ongoing transfer to stop */
        FLEXIO_SPI_DRV_MasterStopTransfer(instance);
        /* Stop processing events */
        return;
    }
    /* Check if data was received */
    if (FLEXIO_HAL_GetShifterStatus(baseAddr, RX_SHIFTER))
    {
        FLEXIO_SPI_DRV_ReadData(instance);
    }
    /* Check if transmitter needs more data */
    if (FLEXIO_HAL_GetShifterStatus(baseAddr, TX_SHIFTER))
    {
        FLEXIO_SPI_DRV_WriteData(instance);
        if (master->txRemainingBytes == 0)
        {
            /* No more data to transmit, disable tx interrupts */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, (1U << TX_SHIFTER), false);
            FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, (1U << TX_SHIFTER), false);
        }
    }

    /* Check there is any data left */
    if ((master->txRemainingBytes == 0) && (master->rxRemainingBytes == 0))
    {
        /* End transfer */
        FLEXIO_SPI_DRV_MasterEndTransfer(instance);
        /* Record success if there was no error */
        if (master->status == FLEXIO_SPI_STATUS_BUSY)
        {
            master->status = FLEXIO_SPI_STATUS_SUCCESS;
        }
    }
}

/*! @endcond */

