arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_spi_driver.c
/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterInit
 * Description   : Initialize the FLEXIO_SPI master mode driver
 *
 *END**************************************************************************/
flexio_spi_status_t FLEXIO_SPI_DRV_MasterInit(uint32_t instance,
                                              const flexio_spi_master_user_config_t * userConfigPtr,
                                              flexio_spi_master_state_t * master)
{
    FLEXIO_Type *baseAddr;
    interrupt_manager_error_code_t intErr;
    flexio_spi_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    if (g_flexioSPIStatePtr[instance])
    {
        return FLEXIO_SPI_STATUS_FAIL;
    }

    baseAddr = g_flexioBase[instance];
    g_flexioSPIStatePtr[instance] = master;

    /* Initialize driver context structure */
    master->driverType = userConfigPtr->driverType;
    master->clockPolarity = userConfigPtr->clockPolarity;
    master->clockPhase = userConfigPtr->clockPhase;
    master->baudRate = userConfigPtr->baudRate;
    master->mosiPin = userConfigPtr->mosiPin;
    master->misoPin = userConfigPtr->misoPin;
    master->sckPin = userConfigPtr->sckPin;
    master->ssPin = userConfigPtr->ssPin;
    master->driverIdle = true;
    master->needReinit = false;
    master->master = true;

    /* Initialize HAL */
    FLEXIO_HAL_Init(baseAddr);

    /* Configure device for SPI mode */
    retCode = FLEXIO_SPI_DRV_MasterConfigure(instance);
    if (retCode != FLEXIO_SPI_STATUS_SUCCESS)
    {
        g_flexioSPIStatePtr[instance] = NULL;
        return retCode;
    }

    /* Set up transfer engine */
    switch (userConfigPtr->driverType)
    {
        case FLEXIO_SPI_DRIVER_TYPE_INTERRUPTS:
            /* Install irq handler */
            intErr = INT_SYS_InstallHandler(g_flexioIrqId[instance], g_flexioIsr[instance], NULL);
            if (intErr == INTERRUPT_MANAGER_ERROR)
            {
                return FLEXIO_SPI_STATUS_FAIL;
            }
            /* Enable FLEXIO interrupts in the interrupt manager */
            INT_SYS_EnableIRQ(g_flexioIrqId[instance]);
            break;
        case FLEXIO_SPI_DRIVER_TYPE_POLLING:
            /* Nothing to do here, FLEXIO_SPI_DRV_MasterGetStatus() will handle the transfer */
            break;
        case FLEXIO_SPI_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    /* Enable module */
    FLEXIO_HAL_SetEnable(baseAddr, true);

    return FLEXIO_SPI_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterDeinit
 * Description   : De-initialize the FLEXIO_SPI master mode driver
 *
 *END**************************************************************************/

flexio_spi_status_t FLEXIO_SPI_DRV_MasterDeinit(uint32_t instance)
{
    flexio_spi_master_state_t *master;
    FLEXIO_Type *baseAddr;
    interrupt_manager_error_code_t intErr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    /* Disable module */
    FLEXIO_HAL_SetEnable(baseAddr, false);

    /* Disable transfer engine */
    if (master != NULL)
    {
        switch (master->driverType)
        {
            case FLEXIO_SPI_DRIVER_TYPE_INTERRUPTS:
                /* Disable FLEXIO interrupt */
                INT_SYS_DisableIRQ(g_flexioIrqId[instance]);
                /* Restore default handler. */
                intErr = INT_SYS_InstallHandler(g_flexioIrqId[instance], DefaultISR, NULL);
                if (intErr == INTERRUPT_MANAGER_ERROR)
                {
                    return FLEXIO_SPI_STATUS_FAIL;
                }
                break;
            case FLEXIO_SPI_DRIVER_TYPE_POLLING:
                /* Nothing to do */
                break;
            case FLEXIO_SPI_DRIVER_TYPE_DMA:
                /* TODO: add DMA support */
                break;
            default: 
                /* Impossible type - do nothing */
                break;
        }
    }

    g_flexioSPIStatePtr[instance] = NULL;

    return FLEXIO_SPI_STATUS_SUCCESS;
}




/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterSetBaudRate
 * Description   : Set the baud rate for any subsequent SPI communication
 *
 *END**************************************************************************/
flexio_spi_status_t FLEXIO_SPI_DRV_MasterSetBaudRate(uint32_t instance, uint32_t baudRate)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_master_state_t *master;
    uint16_t divider;
    uint16_t timerCmp;
    flexio_spi_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    /* Check if driver is busy */
    if (!master->driverIdle)
    {
        return FLEXIO_SPI_STATUS_BUSY;
    }

    master->baudRate = baudRate;
    /* Compute divider */
    retCode = FLEXIO_SPI_DRV_MasterComputeBaudRateDivider(instance, baudRate, &divider);
    if (retCode != FLEXIO_SPI_STATUS_SUCCESS)
    {
        return retCode;
    }

    /* Configure timer divider in the lower 8 bits of TIMCMP[CMP] */
    timerCmp = FLEXIO_HAL_GetTimerCompare(baseAddr, SCK_TIMER);
    timerCmp = (timerCmp & 0xFF00U) | divider;
    FLEXIO_HAL_SetTimerCompare(baseAddr, SCK_TIMER, timerCmp);

    return FLEXIO_SPI_STATUS_SUCCESS;
}



/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterGetBaudRate
 * Description   : Get the currently configured baud rate
 *
 *END**************************************************************************/
flexio_spi_status_t FLEXIO_SPI_DRV_MasterGetBaudRate(uint32_t instance, uint32_t *baudRate)
{
    FLEXIO_Type *baseAddr;
    uint32_t divider;
    uint16_t timerCmp;
    uint32_t inputClock;
    clock_manager_error_code_t clkErr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_SPI_STATUS_FAIL;
    }

