arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_spi_driver.c
    /* Get the currently configured divider */
    timerCmp = FLEXIO_HAL_GetTimerCompare(baseAddr, SCK_TIMER);
    divider = (uint32_t)(timerCmp & 0x00FFU);

    /* Compute baud rate: input_clock / (2 * (divider + 1)). Round to nearest integer */
    *baudRate = (inputClock + divider + 1U) / (2U * (divider + 1U));
    
    return FLEXIO_SPI_STATUS_SUCCESS;
}




/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterTransfer
 * Description   : Perform an SPI master transaction
 *
 *END**************************************************************************/
flexio_spi_status_t FLEXIO_SPI_DRV_MasterTransfer(uint32_t instance,
                                                  const flexio_spi_transfer_t *transfer)
{
    FLEXIO_Type *baseAddr;
    flexio_spi_master_state_t *master;
    uint16_t timerCmp;
    uint16_t shiftCnt;
    flexio_spi_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
    DEV_ASSERT((transfer->transfer_size == FLEXIO_SPI_TRANSFER_1BYTE) ||
               (transfer->transfer_size == FLEXIO_SPI_TRANSFER_2BYTE) ||
               (transfer->transfer_size == FLEXIO_SPI_TRANSFER_4BYTE));
    DEV_ASSERT(transfer->dataSize % (uint32_t)(transfer->transfer_size) == 0);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    /* Check if driver is busy */
    if (!master->driverIdle)
    {
        return FLEXIO_SPI_STATUS_BUSY;
    }

    if (master->needReinit)
    {
        /* Re-initialize module after a forced stop */
        if (master->master)
        {
            retCode = FLEXIO_SPI_DRV_MasterConfigure(instance);
        }
        else
        {
            retCode = FLEXIO_SPI_DRV_SlaveConfigure(instance);
        }
        if (retCode != FLEXIO_SPI_STATUS_SUCCESS)
        {
            return retCode;
        }
        FLEXIO_HAL_SetEnable(baseAddr, true);
    }

    /* Copy transfer data */
    master->txData = transfer->txData;
    master->rxData = transfer->rxData;
    master->txRemainingBytes = transfer->dataSize;
    master->rxRemainingBytes = transfer->dataSize;
    master->bit_order = transfer->bit_order;
    master->transfer_size = transfer->transfer_size;
    master->driverIdle = false;
    master->status = FLEXIO_SPI_STATUS_BUSY;

    if (master->master)
    {
        /* Configure device for requested number of bytes, keeping the existing baud rate */
        shiftCnt = ((uint16_t)(transfer->transfer_size) * 8U * 2U - 1U);
        timerCmp = FLEXIO_HAL_GetTimerCompare(baseAddr, SCK_TIMER);
        timerCmp = (timerCmp & 0x00FFU) | shiftCnt << 8U;
        FLEXIO_HAL_SetTimerCompare(baseAddr, SCK_TIMER, timerCmp);
    }

    /* Enable transfer engine */
    switch (master->driverType)
    {
        case FLEXIO_SPI_DRIVER_TYPE_INTERRUPTS:
            /* Enable interrupts for Rx and Tx shifters */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, 
                                           (1U << TX_SHIFTER) | (1U << RX_SHIFTER), 
                                           true);
            FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, 
                                                (1U << TX_SHIFTER) | (1U << RX_SHIFTER), 
                                                true);
            break;
        case FLEXIO_SPI_DRIVER_TYPE_POLLING:
            /* Call FLEXIO_SPI_DRV_MasterCheckStatus once to send the first byte */
            FLEXIO_SPI_DRV_MasterCheckStatus(instance);
            break;
        case FLEXIO_SPI_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    if (transfer->transfer_type == FLEXIO_SPI_TRANSFER_BLOCKING)
    {
        /* Wait for transfer to end */
        return FLEXIO_SPI_DRV_MasterWaitTransferEnd(instance);
    }

    return FLEXIO_SPI_STATUS_SUCCESS;
}



                                                             
/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterTransferAbort
 * Description   : Aborts a non-blocking SPI master transaction
 *
 *END**************************************************************************/
flexio_spi_status_t FLEXIO_SPI_DRV_MasterTransferAbort(uint32_t instance)
{
    flexio_spi_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    /* Check if driver is busy */
    if (master->driverIdle)
    {
        return FLEXIO_SPI_STATUS_FAIL;
    }

    master->status = FLEXIO_SPI_STATUS_ABORTED;
    /* Force the ongoing transfer to stop */
    FLEXIO_SPI_DRV_MasterStopTransfer(instance);

    return FLEXIO_SPI_STATUS_SUCCESS;
}




/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_MasterGetStatus
 * Description   : Get the status of the current non-blocking SPI master transaction
 *
 *END**************************************************************************/
flexio_spi_status_t FLEXIO_SPI_DRV_MasterGetStatus(uint32_t instance, uint32_t *bytesRemaining)
{
    flexio_spi_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    master = (flexio_spi_master_state_t *)g_flexioSPIStatePtr[instance];

    if ((!master->driverIdle) && (master->driverType == FLEXIO_SPI_DRIVER_TYPE_POLLING))
    {
        /* In polling mode advance the SPI transfer here */
        FLEXIO_SPI_DRV_MasterCheckStatus(instance);
    }

    if (bytesRemaining != NULL)
    {
        *bytesRemaining = master->txRemainingBytes;
    }

    return master->status;
}



/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_SPI_DRV_SlaveInit
 * Description   : Initialize the FLEXIO_SPI slave mode driver
 *
 *END**************************************************************************/
flexio_spi_status_t FLEXIO_SPI_DRV_SlaveInit(uint32_t instance,
                                             const flexio_spi_slave_user_config_t * userConfigPtr,
                                             flexio_spi_slave_state_t * slave)
{
    FLEXIO_Type *baseAddr;
    interrupt_manager_error_code_t intErr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(slave != NULL);
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    if (g_flexioSPIStatePtr[instance])
    {
        return FLEXIO_SPI_STATUS_FAIL;
    }

    baseAddr = g_flexioBase[instance];
    g_flexioSPIStatePtr[instance] = slave;

    /* Initialize driver context structure */
    slave->driverType = userConfigPtr->driverType;
    slave->clockPolarity = userConfigPtr->clockPolarity;
    slave->clockPhase = userConfigPtr->clockPhase;
    slave->mosiPin = userConfigPtr->mosiPin;
    slave->misoPin = userConfigPtr->misoPin;
    slave->sckPin = userConfigPtr->sckPin;
    slave->ssPin = userConfigPtr->ssPin;
    slave->driverIdle = true;
    slave->needReinit = false;
    slave->master = false;

    /* Initialize HAL */
    FLEXIO_HAL_Init(baseAddr);

    /* Configure device for SPI mode */
    (void)FLEXIO_SPI_DRV_SlaveConfigure(instance);

    /* Set up transfer engine */
    switch (userConfigPtr->driverType)
    {
        case FLEXIO_SPI_DRIVER_TYPE_INTERRUPTS:
            /* Install irq handler */
            intErr = INT_SYS_InstallHandler(g_flexioIrqId[instance], g_flexioIsr[instance], NULL);
            if (intErr == INTERRUPT_MANAGER_ERROR)
            {
                return FLEXIO_SPI_STATUS_FAIL;
            }
            /* Enable FLEXIO interrupts in the interrupt manager */
            INT_SYS_EnableIRQ(g_flexioIrqId[instance]);
            break;
        case FLEXIO_SPI_DRIVER_TYPE_POLLING:
            /* Nothing to do here, FLEXIO_SPI_DRV_MasterGetStatus() will handle the transfer */
            break;
        case FLEXIO_SPI_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    /* Enable module */
    FLEXIO_HAL_SetEnable(baseAddr, true);

    return FLEXIO_SPI_STATUS_SUCCESS;
}



/*******************************************************************************
 * EOF
 ******************************************************************************/
